Revit 2027 API
BuiltInFailures.ArrayFailures.IdenticalGeometryCopiesInArray Property
 This array contains multiple copies of some identical geometry. Performance might be improved by using a nested family and arraying copies of its instances.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId IdenticalGeometryCopiesInArray { get; }
Public Shared ReadOnly Property IdenticalGeometryCopiesInArray As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ IdenticalGeometryCopiesInArray {
	FailureDefinitionId^ get ();
}
static member IdenticalGeometryCopiesInArray : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ArrayFailures Class
Autodesk.Revit.DB Namespace